test.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:n1="http://www.rimage.com/RmJobService" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:n2="http://schemas.datacontract.org/2004/07/Rimage.Web.Service" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><n1:SubmitJob><n1:request><n2:Job><n2:ProductionOptions><n2:Copies>1</n2:Copies><n2:FixateType>Sao</n2:FixateType><n2:Merge><n2:MergeData><n2:FieldNames><string>barcode</string><string>description</string><string>barcodeurl</string></n2:FieldNames><n2:FieldValues><ArrayOfstring><string>1234124</string><string>Some description</string><string>some url</string></ArrayOfstring></n2:FieldValues></n2:MergeData></n2:Merge><n2:LabelFile><n2:LabelType>Btw</n2:LabelType><n2:LabelFilePath>\\rimage\Rimage\Labels\belatorbackup.btw</n2:LabelFilePath></n2:LabelFile><n2:MediaType>BdDl</n2:MediaType></n2:ProductionOptions><n2:JobId>1287411755</n2:JobId><n2:Priority>Normal</n2:Priority><n2:Type>ImageAndRecord</n2:Type><n2:ImagingOptions><n2:UdfOptions><n2:Version>Ver150</n2:Version></n2:UdfOptions><n2:ImageFile><n2:SizeInMinutes>BdDl</n2:SizeInMinutes><n2:ImageFilePath>\\192.168.222.50\images\Video_Cayden_Richard_20100805114425</n2:ImageFilePath></n2:ImageFile><n2:VolumeName>Video_Cayden_Richard_20100805114425</n2:VolumeName><n2:AllowOverwrite>true</n2:AllowOverwrite><n2:AllowSpanning>true</n2:AllowSpanning><n2:ParentFolders><n2:ParentFolder><ParentFolderPath>\\192.168.222.50\MAIN-CONTENT-BACKUP\Video\Video_Cayden_Richard_20100805114425</ParentFolderPath></n2:ParentFolder></n2:ParentFolders></n2:ImagingOptions></n2:Job><n2:CallerId>Warehouse</n2:CallerId></n1:request></n1:SubmitJob></env:Body></env:Envelope>